docs/a06/index.tex
% Created 2025-04-21 Mon 09:33
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8x]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{parskip}
\author{Raghav B. Venkataramaiyer}
\date{Mar '25}
\title{Assignment 06 : Visual Object Classification\\\medskip
\large UTA027 : Artificial Intelligence}
\hypersetup{
 pdfauthor={Raghav B. Venkataramaiyer},
 pdftitle={Assignment 06 : Visual Object Classification},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.24)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Dataset Preparation}
\label{sec:orgf365517}
\begin{itemize}
\item Use \href{https://pytorch.org/vision/stable/generated/torchvision.datasets.VOCDetection.html}{\texttt{torchvision.datasets.VOCDetection}} to load the
Pascal VOC 2007 or 2012 dataset.
\item Extract image-level labels from annotations.
\item Convert the dataset into PyTorch tensors.
\item Split the dataset into training and validation sets
(e.g., 80\% training, 20\% validation).
\item Resize and normalize the image data.
\end{itemize}
\section{Data Visualization}
\label{sec:org1a39cb4}
\begin{itemize}
\item Display at least 5 sample images with their bounding
boxes and labels.
\item Plot a bar chart showing the frequency of each object
class.
\item Plot a pie chart of the top 5 most common classes.
\end{itemize}
\section{Build the Classification Model}
\label{sec:org8032370}
\begin{itemize}
\item Choose a pre-trained model from torchvision.models
(e.g., ResNet, VGG).
\item Replace the final layer with a new fully connected
layer to output predictions for 20 classes.
\item Use ReLU activation in hidden layers and softmax
(implicitly handled by loss function) for the output.
\end{itemize}
\section{Train the Model}
\label{sec:orge908922}
\begin{itemize}
\item Define a suitable loss function (e.g.,
CrossEntropyLoss).
\item Choose an optimizer (e.g., Adam or SGD).
\item Train the model for a fixed number of epochs (e.g.,
10–20 epochs).
\item Track and display training and validation loss per
epoch.
\end{itemize}
\section{Evaluate the Model}
\label{sec:org84ddabb}
\begin{itemize}
\item Compute accuracy, precision, and recall on the
validation set.
\item Display a confusion matrix to visualize
classification performance.
\end{itemize}
\end{document}
